---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.ContextualAnalyticalModelModeNotEnabled
source: html/2bd07c94-d8e8-06a9-4df5-6b1c3949a58d.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.ContextualAnalyticalModelModeNotEnabled Property

Contextual Analytical Model not enabled. File open was canceled.

## Syntax (C#)
```csharp
public static FailureDefinitionId ContextualAnalyticalModelModeNotEnabled { get; }
```